app/views/comments/_show.html.erb

INSERT INTO "comments" ("content", "created_at", "good_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Test"], ["created_at", Wed, 04 Dec 2013 14:40:33 UTC +00:00], ["good_id", 1], ["updated_at", Wed, 04 Dec 2013 14:40:33 UTC +00:00], ["user_id", 1]]
---
		<span class="comment-user"><%= comment.user.user_name %></span>
		<span class="comment-time"><%= distance_of_time_in_words_to_now comment.created_at %></span>