app/views/goods/_form.html.erb

      <%= f.label     :category %>
      <%= f.select :category_id , Category.all.collect{ |c| [c.category_title, c.id] }%>
---
SELECT "categories".* FROM "categories"