app/views/goods/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."good_id" = $1  [["good_id", 2]]
---
<div id="comments">
	<% @good.comments.each do |comment| %>