app/controllers/comments_controller.rb

  def create
    @comment = Comment.new comment_params( params )
    @good    = Good.find params[ :good_id ]
    @comment.good = @good
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save
---
SELECT "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("content", "created_at", "good_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Test"], ["created_at", Wed, 04 Dec 2013 14:40:33 UTC +00:00], ["good_id", 1], ["updated_at", Wed, 04 Dec 2013 14:40:33 UTC +00:00], ["user_id", 1]]

  def edit
    @good = Good.find params[ :good_id ]
    @comment = Comment.find params[ :id ]
---
SELECT "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    @good = Good.find params[ :good_id ]
    @comment = Comment.find params[ :id ]

    respond_to do |format|
      if @comment.update_attributes( comment_params( params ) )
---
SELECT "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = 1  [["content", "new"], ["updated_at", Wed, 04 Dec 2013 15:23:29 UTC +00:00]]