app/controllers/goods_controller.rb

INSERT INTO "goods" ("created_at", "description", "price", "status", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Sun, 01 Dec 2013 15:13:22 UTC +00:00], ["description", "Test & Test"], ["price", 200.0], ["status", "open"], ["title", "Test"], ["updated_at", Sun, 01 Dec 2013 15:13:22 UTC +00:00]]
---
  def create
    @good = Good.new good_params( params )
    @good.user = current_user if current_user

    if @good.save

UPDATE "goods" SET "description" = $1, "updated_at" = $2 WHERE "goods"."id" = 1  [["description", "xxx"], ["updated_at", Sun, 01 Dec 2013 15:17:17 UTC +00:00]]
---
  def update
    #@good = Good.find params[:id]
    if @good.update_attributes good_params( params )

SELECT "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @good = Good.find params[:id]

UPDATE "goods" SET "status" = $1, "updated_at" = $2 WHERE "goods"."id" = 1  [["status", "close"], ["updated_at", Sun, 01 Dec 2013 15:21:01 UTC +00:00]]
---
  def close
    #@good = Good.find params[:id]
    @good.close!
    @good.save

SELECT "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "goods" SET "status" = $1, "updated_at" = $2 WHERE "goods"."id" = 2  [["status", "warned"], ["updated_at", Sun, 01 Dec 2013 15:30:56 UTC +00:00]]
---
  def warn
    @good = Good.find params[:id]
    @good.warned!
    @good.save