app/controllers/market_controller.rb

SELECT "goods".* FROM "goods"
SELECT "categories".* FROM "categories"
---
  def index
    @goods = Good.all_open.paginate( :page => page , :per_page => per_page )
    @categories = Category.all

SELECT "goods".* FROM "goods" WHERE (title ilike '%test%' or description ilike '%test%')
---
  def search
    @keyword = params[:keyword]
    @results = Good.all_open
                  .includes( :user )
                  .where('title ilike :q or description ilike :q or users.email ilike :q' , :q => "%#{@keyword}%")
                  .paginate( :page => page , :per_page => per_page )

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 ORDER BY "categories"."id" ASC LIMIT 1  [["id", 1]]
SELECT "goods".* FROM "goods" WHERE "goods"."category_id" = $1  [["category_id", 1]]
---
  def category
    @categories = Category.all
    @category = Category.find params[:id]
    @goods = @category.goods.all_open.paginate( :page => page , :per_page => per_page )