app/controllers/problemset2_controller.rb

  def index
    if (params[:search])
      puts search(params[:search], sort_column + ' ', cookies[:quotation_id]).length
    else
      @quotations = Quotation.order(sort_column + ' ' )
---
SELECT "quotations".* FROM "quotations" ORDER BY quote_category

  def create
    @quotation = Quotation.new(quotation_params)
    @quotation.save
---
INSERT INTO "quotations" ("author_name", "created_at", "quote", "quote_category", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "Jeff"], ["created_at", Sun, 08 Dec 2013 13:54:12 UTC +00:00], ["quote", "hello World"], ["quote_category", "myword"], ["updated_at", Sun, 08 Dec 2013 13:54:12 UTC +00:00]]